       IDENTIFICATION DIVISION.
       PROGRAM-ID. 5Hello.
       AUTHOR. Terry.
       

       PROCEDURE DIVISION.
       
      *On effectue 5 fois la série d'instruction
           PERFORM 5 TIMES
                  DISPLAY "Bonjour"
           END-PERFORM.

           STOP RUN.
